Autodesk.Revit.DB.Structure.RebarShapeDefinitionByArc.SetConstraints(System.Collections.Generic.IList`1{Autodesk.Revit.DB.Structure.RebarShapeConstraint})
Assign a new list of constraints to this definition.
Remarks:
Any existing constraints are discarded. The new constraints replace them.
Any parameters driving the constraints must already be added
with AddParameter().
If the Type is Arc or LappedCircle, the allowable constraint types are:
RebarShapeConstraintArcLengthRebarShapeConstraintRadiusRebarShapeConstraintDiameterRebarShapeConstraintCircumferenceRebarShapeConstraintSagittaLengthRebarShapeConstraintChordLength
At least two independent constraints must be specified. Overconstraining
is supported.
If the Type is Spiral, the allowable constraints are:
RebarShapeConstraintRadiusRebarShapeConstraintDiameterRebarShapeConstraintCircumference
At least one constraint must be specified.
constraints:
A new list of constraints.
Throws Autodesk.Revit.Exceptions.ArgumentException:
One or more of the constraints is of a type not supported for this definition.
-or-
One or more of the constraints refers to a parameter that has not been added yet.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012